Revit 2027 API
ParameterTypeId.RebarContainerBarType Property
 "Bar Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarContainerBarType { get; }
Public Shared ReadOnly Property RebarContainerBarType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarContainerBarType {
	ForgeTypeId^ get ();
}
static member RebarContainerBarType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace